package com.hyc.helper.bean;

import java.util.List;

public class GradeBean extends BaseRequestBean{

  /**
   * code : 200
   * data : [{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"大学英语2","xf":"3.5","cj":"73.0","zscj":"73.0","bkcj":"","jd":"2.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"高等数学2","xf":"5.0","cj":"68.0","zscj":"68.0","bkcj":"","jd":"1.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"体育2","xf":"1.0","cj":"95.0","zscj":"95.0","bkcj":"","jd":"4.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"\u201c面向对象程序设计\u201d课程设计","xf":"1.0","cj":"75.0","zscj":"75.0","bkcj":"","jd":"2.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"大学物理A1","xf":"2.5","cj":"80.0","zscj":"80.0","bkcj":"","jd":"3.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"大学物理实验1","xf":"0.5","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"面向对象程序设计","xf":"3.5","cj":"78.0","zscj":"78.0","bkcj":"","jd":"2.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"电工学1","xf":"2.5","cj":"79.0","zscj":"79.0","bkcj":"","jd":"2.9","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"离散数学","xf":"3.0","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"应用写作","xf":"2.0","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"校公选","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"中国近现代史纲要","xf":"2.0","cj":"83.0","zscj":"83.0","bkcj":"","jd":"3.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"电工学实验1","xf":"0.5","cj":"75.0","zscj":"75.0","bkcj":"","jd":"2.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"2","kcmc":"影视鉴赏","xf":"2.0","cj":"69.0","zscj":"69.0","bkcj":"","jd":"1.9","cxbj":"0","kcxz":"校公选","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"军事理论","xf":"1.0","cj":"83.0","zscj":"83.0","bkcj":"","jd":"3.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"思想道德修养与法律基础","xf":"3.0","cj":"84.0","zscj":"84.0","bkcj":"","jd":"3.4","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"\u201c面向过程程序设计\u201d课程设计","xf":"1.0","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"面向过程程序设计(C语言)","xf":"4.0","cj":"90.0","zscj":"90.0","bkcj":"","jd":"4.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"军事训练","xf":"2.0","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"软件工程引论","xf":"3.0","cj":"83.0","zscj":"83.0","bkcj":"","jd":"3.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"大学生心理健康","xf":"2.0","cj":"80.0","zscj":"80.0","bkcj":"","jd":"3.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"体育1","xf":"1.0","cj":"95.0","zscj":"95.0","bkcj":"","jd":"4.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"高等数学1","xf":"5.0","cj":"82.0","zscj":"82.0","bkcj":"","jd":"3.2","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2015-2016","xq":"1","kcmc":"大学英语1","xf":"3.5","cj":"72.0","zscj":"72.0","bkcj":"","jd":"2.2","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"计算机组成原理","xf":"3.5","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"\u201c计算机组成原理\u201d课程设计","xf":"1.0","cj":"71.0","zscj":"71.0","bkcj":"","jd":"2.1","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"毛泽东思想和中国特色社会主义理论概论课1","xf":"3.0","cj":"77.0","zscj":"77.0","bkcj":"","jd":"2.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":".net软件开发技术课程设计","xf":"1.0","cj":"90.0","zscj":"90.0","bkcj":"","jd":"4.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"大学英语4","xf":"3.0","cj":"68.0","zscj":"68.0","bkcj":"","jd":"1.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"体育4","xf":"1.0","cj":"95.0","zscj":"95.0","bkcj":"","jd":"4.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"数据库原理","xf":"3.0","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"数据库原理课程设计","xf":"1.0","cj":"90.0","zscj":"90.0","bkcj":"","jd":"4.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"创业基础","xf":"2.0","cj":"87.0","zscj":"87.0","bkcj":"","jd":"3.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"包装世界（网络课程）","xf":"0.5","cj":"77.0","zscj":"77.0","bkcj":"","jd":"2.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"认识实习","xf":"1.0","cj":"95.0","zscj":"95.0","bkcj":"","jd":"4.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":".net软件开发技术","xf":"3.5","cj":"90.0","zscj":"90.0","bkcj":"","jd":"4.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"2","kcmc":"概率论与数理统计C","xf":"2.5","cj":"97.0","zscj":"97.0","bkcj":"","jd":"4.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"大学物理实验2","xf":"1.0","cj":"75.0","zscj":"75.0","bkcj":"","jd":"2.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"书法鉴赏","xf":"2.0","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"校公选","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"大学英语3","xf":"3.0","cj":"78.0","zscj":"78.0","bkcj":"","jd":"2.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"线性代数","xf":"2.5","cj":"83.0","zscj":"83.0","bkcj":"","jd":"3.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"电工学2","xf":"2.0","cj":"88.0","zscj":"88.0","bkcj":"","jd":"3.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"电工学实验2","xf":"0.5","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"数据结构","xf":"4.0","cj":"72.0","zscj":"72.0","bkcj":"","jd":"2.2","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"马克思主义基本原理","xf":"3.0","cj":"63.0","zscj":"63.0","bkcj":"","jd":"1.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"体育3","xf":"1.0","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"大学物理A2","xf":"2.5","cj":"79.0","zscj":"79.0","bkcj":"","jd":"2.9","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"脚本语言开发技术课程设计","xf":"1.0","cj":"95.0","zscj":"95.0","bkcj":"","jd":"4.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"数据结构课程设计","xf":"1.0","cj":"85.0","zscj":"85.0","bkcj":"","jd":"3.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"脚本语言开发技术","xf":"3.5","cj":"78.0","zscj":"78.0","bkcj":"","jd":"2.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"PhotoShop图像处理技术","xf":"2.0","cj":"87.0","zscj":"87.0","bkcj":"","jd":"3.7","cxbj":"0","kcxz":"校公选","bj":""},{"xh":"15408300210","xn":"2016-2017","xq":"1","kcmc":"大学生职业生涯规划","xf":"1.0","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"就业指导","xf":"1.0","cj":"93.0","zscj":"93.0","bkcj":"","jd":"4.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"生产实习","xf":"5.0","cj":"75.0","zscj":"75.0","bkcj":"","jd":"2.5","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"网络工程","xf":"3.0","cj":"90.0","zscj":"90.0","bkcj":"","jd":"4.0","cxbj":"0","kcxz":"选修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"JavaEE开发技术课程设计","xf":"1.0","cj":"74.0","zscj":"74.0","bkcj":"","jd":"2.4","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"JavaEE开发技术","xf":"3.5","cj":"88.0","zscj":"88.0","bkcj":"","jd":"3.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"移动互联网","xf":"3.0","cj":"77.0","zscj":"77.0","bkcj":"","jd":"2.7","cxbj":"0","kcxz":"选修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"软件工程课程设计","xf":"1.0","cj":"86.0","zscj":"86.0","bkcj":"","jd":"3.6","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"2","kcmc":"软件工程","xf":"4.0","cj":"81.0","zscj":"81.0","bkcj":"","jd":"3.1","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"计算机网络","xf":"3.5","cj":"87.0","zscj":"87.0","bkcj":"","jd":"3.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"计算机操作系统","xf":"3.5","cj":"74.0","zscj":"74.0","bkcj":"","jd":"2.4","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"Java程序设计","xf":"4.0","cj":"78.0","zscj":"78.0","bkcj":"","jd":"2.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"计算机网络课程设计","xf":"1.0","cj":"87.0","zscj":"87.0","bkcj":"","jd":"3.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"大型数据库应用","xf":"2.5","cj":"88.0","zscj":"88.0","bkcj":"","jd":"3.8","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"计算机操作系统课程设计","xf":"1.0","cj":"80.0","zscj":"80.0","bkcj":"","jd":"3.0","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"大型数据库应用课程设计","xf":"1.0","cj":"93.0","zscj":"93.0","bkcj":"","jd":"4.3","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"毛泽东思想和中国特色社会主义理论概论课2","xf":"3.0","cj":"77.0","zscj":"77.0","bkcj":"","jd":"2.7","cxbj":"0","kcxz":"必修课","bj":""},{"xh":"15408300210","xn":"2017-2018","xq":"1","kcmc":"Java程序设计课程设计","xf":"1.0","cj":"91.0","zscj":"91.0","bkcj":"","jd":"4.1","cxbj":"0","kcxz":"必修课","bj":""}]
   */

  private List<DataBean> data;

  public List<DataBean> getData() {
    return data;
  }

  public void setData(List<DataBean> data) {
    this.data = data;
  }

  public static class DataBean {
    /**
     * xh : 15408300210
     * xn : 2015-2016
     * xq : 2
     * kcmc : 大学英语2
     * xf : 3.5
     * cj : 73.0
     * zscj : 73.0
     * bkcj :
     * jd : 2.3
     * cxbj : 0
     * kcxz : 必修课
     * bj :
     */

    private String xh;
    private String xn;
    private String xq;
    private String kcmc;
    private String xf;
    private String cj;
    private String zscj;
    private String bkcj;
    private String jd;
    private String cxbj;
    private String kcxz;
    private String bj;

    public String getXh() {
      return xh;
    }

    public void setXh(String xh) {
      this.xh = xh;
    }

    public String getXn() {
      return xn;
    }

    public void setXn(String xn) {
      this.xn = xn;
    }

    public String getXq() {
      return xq;
    }

    public void setXq(String xq) {
      this.xq = xq;
    }

    public String getKcmc() {
      return kcmc;
    }

    public void setKcmc(String kcmc) {
      this.kcmc = kcmc;
    }

    public String getXf() {
      return xf;
    }

    public void setXf(String xf) {
      this.xf = xf;
    }

    public String getCj() {
      return cj;
    }

    public void setCj(String cj) {
      this.cj = cj;
    }

    public String getZscj() {
      return zscj;
    }

    public void setZscj(String zscj) {
      this.zscj = zscj;
    }

    public String getBkcj() {
      return bkcj;
    }

    public void setBkcj(String bkcj) {
      this.bkcj = bkcj;
    }

    public String getJd() {
      return jd;
    }

    public void setJd(String jd) {
      this.jd = jd;
    }

    public String getCxbj() {
      return cxbj;
    }

    public void setCxbj(String cxbj) {
      this.cxbj = cxbj;
    }

    public String getKcxz() {
      return kcxz;
    }

    public void setKcxz(String kcxz) {
      this.kcxz = kcxz;
    }

    public String getBj() {
      return bj;
    }

    public void setBj(String bj) {
      this.bj = bj;
    }
  }
}
